УТ/src/Catalogs/CRM_ПланПродаж/CRM_ПланПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ПланПродаж</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СхемаПланаПродаж</name>
    <type>
      <types>CatalogRef.CRM_СхемаПланаПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНомерНедели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЗначений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДробнаяЧасть</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКоличество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСумму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.CRM_ЕдиницыИзмеренияПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеВерхнегоУровня</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПолученияФакта</name>
    <type>
      <types>EnumRef.CRM_ВариантыПолученияФактаПродажи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Администраторы</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/InformationRegisters/CRM_ПланПродаж/CRM_ПланПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ПланПродаж</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПрогноз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПрогноз</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтрокиРодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПланаРодителя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрогноз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПланПродаж</name>
    <type>
      <types>CatalogRef.CRM_ПланПродаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодПлана</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаПланаПродаж</name>
    <type>
      <types>CatalogRef.CRM_КлючиАналитикиПланаПродаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УровеньИерархии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Enums/CRM_ВариантыПолученияФактаПродажи/CRM_ВариантыПолученияФактаПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВариантыПолученияФактаПродажи</name>
  <enumValues>
    <name>ПоВыручке</name>
  </enumValues>
  <enumValues>
    <name>ПоОплате</name>
  </enumValues>
  <enumValues>
    <name>Меньшее</name>
  </enumValues>
</mdclass:Enum>

УТ/src/Catalogs/CRM_СхемаПланаПродаж/CRM_СхемаПланаПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СхемаПланаПродаж</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПериодичностьПрогнозирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлементыСхемы</name>
    <attributes>
      <name>Разрез</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ТипыАналитикПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <comment>Номер строки-родителя в табличной части</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУровня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.Периодичность</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/ChartsOfCharacteristicTypes/CRM_ТипыАналитикПланирования/CRM_ТипыАналитикПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>CRM_ТипыАналитикПланирования</name>
  <type>
    <types>CatalogRef.ВидыНоменклатуры</types>
    <types>CatalogRef.CRM_СегментыРынка</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.Партнеры</types>
    <types>CatalogRef.НаправленияДеятельности</types>
    <types>CatalogRef.БизнесРегионы</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.CRM_Отрасли</types>
    <types>CatalogRef.ТоварныеКатегории</types>
  </type>
  <predefined>
    <items>
      <name>Партнеры_БизнесРегион</name>
      <description>Бизнес регион</description>
      <code>000000012</code>
      <type>
        <types>CatalogRef.БизнесРегионы</types>
      </type>
    </items>
    <items>
      <name>Номенклатура_ВидНоменклатуры</name>
      <description>Вид номенклатуры</description>
      <code>000000008</code>
      <type>
        <types>CatalogRef.ВидыНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>Номенклатура_Родитель</name>
      <description>Группа номенклатуры</description>
      <code>000000010</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Менеджеры</name>
      <description>Менеджеры</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </items>
    <items>
      <name>Номенклатура_НаправлениеДеятельности</name>
      <description>Направления деятельности</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Партнеры_ОсновнаяОтрасль</name>
      <description>Основная отрасль</description>
      <code>000000011</code>
      <type>
        <types>CatalogRef.CRM_Отрасли</types>
      </type>
    </items>
    <items>
      <name>Партнеры</name>
      <description>Партнеры</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </items>
    <items>
      <name>Подразделение</name>
      <description>Подразделение</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </items>
    <items>
      <name>Партнеры_СегментРынка</name>
      <description>Сегмент рынка</description>
      <code>000000013</code>
      <type>
        <types>CatalogRef.CRM_СегментыРынка</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>Номенклатура_ТоварнаяКатегория</name>
      <description>Товарная категория</description>
      <code>000000009</code>
      <type>
        <types>CatalogRef.ТоварныеКатегории</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

УТ/src/Catalogs/CRM_ПланПродаж/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
	
		Возврат;
	
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Администратор = Объект.Администраторы.Добавить();
		Администратор.Пользователь = Пользователи.ТекущийПользователь();
		ПриЧтенииСозданииНаСервере();
	Иначе
		Элементы.ГруппаОсновное.Доступность = (Не ПланИспользуется());
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

КонецПроцедуры
 
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();

	CRM_МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ОтображатьДиапазонДат = Не Объект.ОтображатьНомерНедели;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИспользоватьСуммуПриИзменении(Неопределено);
	ИспользоватьКоличествоПриИзменении(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура СхемаПланаПродажПриИзмененииНаСервере()
	
	ДоступностьВарианта = ДоступенВыборВариантаФакта(Объект.СхемаПланаПродаж);
	Элементы.ВариантПолученияФакта.Доступность = ДоступностьВарианта;
	Если Не ДоступностьВарианта Тогда
		Объект.ВариантПолученияФакта = Перечисления.CRM_ВариантыПолученияФактаПродажи.ПоВыручке;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаПланаПродажПриИзменении(Элемент)
	СхемаПланаПродажПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСуммуПриИзменении(Элемент)
	
	Элементы.ГруппаНастройкиСумма2.Доступность = Объект.ИспользоватьСумму;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКоличествоПриИзменении(Элемент)
	
	Элементы.ГруппаНастройкиКоличество2.Доступность = Объект.ИспользоватьКоличество;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеНеделиПриИзменении(Элемент)
	
	Объект.ОтображатьНомерНедели = Не ОтображатьДиапазонДат;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьНомерНеделиПриИзменении(Элемент)
	
	ОтображатьДиапазонДат = Не Объект.ОтображатьНомерНедели;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПланИспользуется()
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	CRM_ПланПродаж.ПланПродаж КАК ПланПродаж
	                      |ИЗ
	                      |	РегистрСведений.CRM_ПланПродаж КАК CRM_ПланПродаж
	                      |ГДЕ
	                      |	CRM_ПланПродаж.ПланПродаж = &ПланПродаж");
	
	Запрос.УстановитьПараметр("ПланПродаж", Объект.Ссылка);
	Результат = Не Запрос.Выполнить().Пустой();
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДоступенВыборВариантаФакта(Схема)

	ТипыАналитикОплата = Новый Массив;
	ТипыАналитикОплата.Добавить(ПланыВидовХарактеристик.CRM_ТипыАналитикПланирования.Подразделение);
	ТипыАналитикОплата.Добавить(ПланыВидовХарактеристик.CRM_ТипыАналитикПланирования.Менеджеры);
	ТипыАналитикОплата.Добавить(ПланыВидовХарактеристик.CRM_ТипыАналитикПланирования.Партнеры);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СхемаПланаПродажЭлементыСхемы.Разрез КАК Разрез
	                      |ИЗ
	                      |	Справочник.CRM_СхемаПланаПродаж.ЭлементыСхемы КАК CRM_СхемаПланаПродажЭлементыСхемы
	                      |ГДЕ
	                      |	CRM_СхемаПланаПродажЭлементыСхемы.Ссылка = &Схема
	                      |	И НЕ CRM_СхемаПланаПродажЭлементыСхемы.Разрез В (&ТипыАналитик)");
	Запрос.УстановитьПараметр("Схема", Схема);
	Запрос.УстановитьПараметр("ТипыАналитик", ТипыАналитикОплата);
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;

	ТипыАналитикПартнер = Новый Массив;
	ТипыАналитикПартнер.Добавить(ПланыВидовХарактеристик.CRM_ТипыАналитикПланирования.Партнеры);

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СхемаПланаПродажЭлементыСхемы.Разрез КАК Разрез
	                      |ИЗ
	                      |	Справочник.CRM_СхемаПланаПродаж.ЭлементыСхемы КАК CRM_СхемаПланаПродажЭлементыСхемы
	                      |ГДЕ
	                      |	CRM_СхемаПланаПродажЭлементыСхемы.Ссылка = &Схема
	                      |	И CRM_СхемаПланаПродажЭлементыСхемы.Разрез В (&ТипыАналитик)");
	Запрос.УстановитьПараметр("Схема", Схема);
	Запрос.УстановитьПараметр("ТипыАналитик", ТипыАналитикПартнер);
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
